Tekla.Structures.Drawing.LineTypesEnum
The line types (the presentation of the line).

Tekla.Structures.Drawing.LineTypesEnum.UndefinedLine
The line type is undefined.

Tekla.Structures.Drawing.LineTypesEnum.SolidLine
The solid line (default).

Tekla.Structures.Drawing.LineTypesEnum.DashedLine
The dashed line (-----).

Tekla.Structures.Drawing.LineTypesEnum.SlashedLine
The slashed line (- - -).

Tekla.Structures.Drawing.LineTypesEnum.DashDot
The dash dotted line (--.--.).

Tekla.Structures.Drawing.LineTypesEnum.DottedLine
The dotted line (.....).

Tekla.Structures.Drawing.LineTypesEnum.DashDoubleDot
The dash double dotted line (-..-..-).

Tekla.Structures.Drawing.LineTypesEnum.SlashDash
The slash dash line (-- - -- -).

Tekla.Structures.Drawing.LineTypesEnum.Custom
The custom line type (it will also transport the custom line type name)